* MySQL Connector/ODBC ,
The database mydb has the table. We need to connect to the database we want to connect to which we use the connector
To connect the logic is used which is the mysql.connector which will help us to connect to any database

create a database called mydatabase

In [2]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="aneesha!@1994"
)
print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002571E8AD2E0>

* MySQLCursor

is used to execute statements to communicate with the MySQL database.

Using the methods of it you can execute SQL statements, fetch data from the result sets, call procedures.

You can create Cursor object using the cursor() method of the Connection object/class.

* execute()

This method accepts a MySQL query as a parameter and executes the given query.

In [3]:
mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE Aneeshadatabase")

DatabaseError: 1007 (HY000): Can't create database 'aneeshadatabase'; database exists

In [23]:
mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE database1")

# CREATING TABLE INSIDE A DATABASE

In [44]:
#creating table names
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE marks (gender VARCHAR(6), student_id INTEGER(10),marks INTEGER(3) )")

ProgrammingError: 1050 (42S01): Table 'marks' already exists

the number inside the variable type is the maximum number of charachter it should hold

DATATYPES

CHAR(size)	A FIXED length string (can contain letters, numbers, and special characters). The size parameter specifies the column length in characters - can be from 0 to 255. Default is 1

VARCHAR(size)	A VARIABLE length string (can contain letters, numbers, and special characters). The size parameter specifies the maximum column length in characters - can be from 0 to 65535

BINARY(size)	Equal to CHAR(), but stores binary byte strings. The size parameter specifies the column length in bytes. Default is 1

VARBINARY(size)	Equal to VARCHAR(), but stores binary byte strings. The size parameter specifies the maximum column length in bytes.

TINYBLOB	For BLOBs (Binary Large OBjects). Max length: 255 bytes

TINYTEXT	Holds a string with a maximum length of 255 characters

TEXT(size)	Holds a string with a maximum length of 65,535 bytes

BLOB(size)	For BLOBs (Binary Large OBjects). Holds up to 65,535 bytes of data

MEDIUMTEXT	Holds a string with a maximum length of 16,777,215 characters
MEDIUMBLOB	For BLOBs (Binary Large OBjects). Holds up to 16,777,215 bytes of data
LONGTEXT	Holds a string with a maximum length of 4,294,967,295 characters

LONGBLOB	For BLOBs (Binary Large OBjects). Holds up to 4,294,967,295 bytes of data

ENUM(val1, val2, val3, ...)	A string object that can have only one value, chosen from a list of possible values. You can list up to 65535 values in an ENUM list. If a value is inserted that is not in the list, a blank value will be inserted. The values are sorted in the order you enter them

SET(val1, val2, val3, ...)	A string object that can have 0 or more values, chosen from a list of possible values. You can list up to 64 values in a SET list

In [39]:
#CREATING TABLES tennis
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE tennis (name VARCHAR(6), racquet  VARCHAR(6),balls INTEGER(3) )")

In [41]:
#checking if any tables available

mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")

for x in mycursor:
    print(x)

('marks',)
('tennis',)

# DATA INSERTION INTO THE TABLE

1.SINGLE RECORD INSERT

In [26]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

sql = "INSERT INTO marks(gender,student_id,marks) VALUES ('Male',1827394,546)"

mycursor.execute(sql)
mydb.commit()

#to know how many records inserted
print(mycursor.rowcount, "record inserted.")

1 record inserted.

commit(): MySQLConnection.commit() method sends a COMMIT statement to the MySQL server, committing the current transaction. After the successful execution of a query make changes persistent into a database using the commit() of a connection class.

rowcount returns the number of rows affected by the last execute method for the same cur object and thus it returns -1 for the first cur. rowcount call as there is no previous execute() method. cursor. rowcount() will output -1 until you have fetched all rows of the result.

2.MULTIPLE RECORD INSERTION

In [27]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

sql = "INSERT INTO marks(gender,student_id,marks) VALUES ('Male',1827394,546),('Female',18283829,726),('male',182738293,767)"

mycursor.execute(sql)
mydb.commit()

#to know how many records inserted
print(mycursor.rowcount, "record inserted.")

3 record inserted.

3.Another way of Inserting records

a.single
sql = "INSERT INTO customers (name, address) VALUES (%s, %s)"
val = ("John", "Highway 21")
mycursor.execute(sql, val)

b.multiple=>

In [28]:
sql = "INSERT INTO marks (gender, student_id,marks) VALUES (%s, %s,%s)"
val =(('Male',1827394,546),('Female',18283829,726),('male',182738293,767))
      
mycursor.executemany(sql,val)
mydb.commit()

print(mycursor.rowcount, "record inserted.")

3 record inserted.

the executemany() method iterates through the sequence of parameters, each time passing the current parameters to the the execute() method.

# DATA SELECTION FROM TABLE

1.Selecting based on no condition

In [29]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()
mycursor.execute("SELECT * FROM marks")

myresult=mycursor.fetchall()

for x in myresult:
    print(x)

('Male', 1827394, 100)
('Male', 1827394, 100)
('Female', 18283829, 100)
('male', 182738293, 767)
('Male', 1827394, 100)
('Male', 1827394, 100)
('Female', 18283829, 100)
('male', 182738293, 767)
('Male', 1827394, 100)
('Female', 18283829, 100)
('male', 182738293, 767)
('Male', 1827394, 546)
('Male', 1827394, 546)
('Female', 18283829, 726)
('male', 182738293, 767)
('Male', 1827394, 546)
('Female', 18283829, 726)
('male', 182738293, 767)

cursor.fetchall() returns all the rows of a query result. It returns all the rows as a list of tuples. An empty list is returned if there is no record to fetch.


cursor.fetchmany(size) returns the number of rows specified by size argument. When called repeatedly this method fetches the next set of rows of a query result and returns a list of tuples. If no more rows are available, it returns an empty list.


cursor.fetchone() method returns a single record or None if no more rows are available.

"*" means selecting all of them

2.selecting based on condition

In [30]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

sql="SELECT DISTINCT * FROM marks WHERE student_id =1827394"

mycursor.execute(sql)
myresult=mycursor.fetchall()

for x in myresult:
    print(x)

('Male', 1827394, 100)
('Male', 1827394, 546)

DITINCT--> means unique records
here the student id is unique

3.selecting a coloumn- displaying the data based on the marks-in ascending/descending manner

In [31]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

sql="SELECT * FROM marks ORDER BY marks"

mycursor.execute(sql)
myresult=mycursor.fetchall()
for x in myresult:
    print(x)

('Male', 1827394, 100)
('Male', 1827394, 100)
('Female', 18283829, 100)
('Male', 1827394, 100)
('Male', 1827394, 100)
('Female', 18283829, 100)
('Male', 1827394, 100)
('Female', 18283829, 100)
('Male', 1827394, 546)
('Male', 1827394, 546)
('Male', 1827394, 546)
('Female', 18283829, 726)
('Female', 18283829, 726)
('male', 182738293, 767)
('male', 182738293, 767)
('male', 182738293, 767)
('male', 182738293, 767)
('male', 182738293, 767)

ascending order-ORDER BY marks

descending order-ORDER BY marks desc

4.Updating/changing things in a table

In [32]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

sql="UPDATE marks SET marks=100 WHERE student_id=18283829"

mycursor.execute(sql)

mydb.commit()

print(mycursor.rowcount,"record(s) affected")

2 record(s) affected

commit() is only used for data maipulation

# DATABASE DROP

In [36]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

sql="DROP DATABASE database1"

mycursor.execute(sql)

In [37]:
mycursor.execute("SHOW DATABASES")

for x in mycursor:
    print(x)

('aneeshadatabase',)
('information_schema',)
('mydatabase',)
('mydatabase1',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

# DROPPING A TABLE

In [42]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

mycursor.execute("SHOW TABLES")
for x in mycursor:
    print(x)

('marks',)
('tennis',)

In [43]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

sql="DROP TABLE tennis"
mycursor.execute(sql)

print(mycursor.rowcount,"record(s) affected")

0 record(s) affected

table is not record-->hence 0 record affected

# SQL REFERENTIAL INTEGRITY

# JOINING TWO TABLES USING PRIMARY KEY

In [ ]:
#creating database
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="aneesha!@1994"
)
mycursor = mydb.cursor()

mycursor.execute("CREATE DATABASE joindatabase")

In [ ]:
#creating table
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  passwd="aneesha!@1994",
  database="joindatabase"
)
mycursor = mydb.cursor()
mycursor.execute("CREATE TABLE marks (name VARCHAR(10), student_id INTEGER(10),marks INTEGER(3) )")
mycursor.execute("CREATE TABLE tennis (name VARCHAR(10), racquet  VARCHAR(10)")

In [ ]:
#inserting multiple values in the table marks
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="joindatabase"
)

mycursor = mydb.cursor()

sql = "INSERT INTO marks(name,student_id,marks) VALUES ('aneesha',1827394,273),('anish',18283829,726),('biju',182738293,767)"
mycursor.execute(sql)
mydb.commit()

In [ ]:
#inserting multiple values in the table tennis
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="joindatabase"
)

mycursor = mydb.cursor()

sql = "INSERT INTO tennis(name,racquet) VALUES ('aneesha','wilson'),('anish','head'),('biju','wilson')"
mycursor.execute(sql)
mydb.commit()

deleting database
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="Aneeshadatabase"
)

mycursor = mydb.cursor()

sql="DROP DATABASE joindatabase"

mycursor.execute(sql)

The INNER JOIN keyword 
selects records that have matching values in both tables:

SELECT column_name(s)

FROM table1

INNER JOIN table2

ON table1.column_name = table2.column_name;

In [ ]:
#primary key is name
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="aneesha!@1994",
  database="joindatabase"
)

mycursor = mydb.cursor()

sql="SELECT tennis.name,tennis.racquet,marks.student_id,marks.marks FROM tennis INNER JOIN marks ON tennis.name= marks.name"

mycursor.execute(sql)
myresult=mycursor.fetchall()

for x in myresult:
    print(x)

SELECT-->all of them other than table1.primarykey

FROM-->table1

INNER JOIN-->table2

ON-->table1.primarykey=table2.primarykey

# SQL RIGHT JOIN Keyword

The RIGHT JOIN keyword returns all records from the right table (table2), and the matching records from the left table (table1) even if its none

hard topic